[
  {
    "yearRange": "2021 - Present",
    "title": "Senior Full-Stack Engineer",
    "company": "Slalom",
    "location": "Denver, Colorado",
    "dateStart": "Oct 2021",
    "dateEnd": "Present",
    "description": "Built enterprise-scale web applications for one of the largest agricultural companies in the world. Ongoing projects include a cross-platform UI library and a cross-platform, greenfield FinTech app, among others. Collaborated with cross-functional teams to deliver innovative solutions that exceeded client needs."
  },
  {
    "yearRange": "2019 - 2021",
    "title": "Full-Stack Software Engineer",
    "company": "Blndspt",
    "location": "Denver, Colorado",
    "dateStart": "Oct 2019",
    "dateEnd": "Oct 2021",
    "description": "Developed on a wide range of projects, delivering scalable solutions across industries, with a focus on accessibility within enterprise-scale web applications. Worked closely with clients to understand their requirements and deliver high-quality, accessible solutions."
  },
  {
    "yearRange": "2018 - 2019",
    "title": "Full-Stack Engineer Apprenticeship",
    "company": "Thinkful",
    "location": "Denver, Colorado",
    "dateStart": "Oct 2018",
    "dateEnd": "Jun 2019",
    "description": "Created and deployed mobile-first applications while honing technical skills by collaborating with other developers. Gained hands-on experience with modern web development technologies and methodologies."
  },
  {
    "yearRange": "2017 - 2018",
    "title": "Architect",
    "company": "Galloway",
    "location": "Denver, Colorado",
    "dateStart": "Nov 2017",
    "dateEnd": "Oct 2018",
    "description": "Led operations on a variety of project types, including a minor league baseball stadium and a large apartment complex. Managed projects from design through construction."
  },
  {
    "yearRange": "2014 - 2017",
    "title": "Project Architect",
    "company": "Venture",
    "location": "Denver, Colorado",
    "dateStart": "Sep 2014",
    "dateEnd": "Oct 2017",
    "description": "Managed multi-family and interiors projects, including budgeting, scheduling, proposal preparation, exterior design, construction document management, client presentations, consultant coordination, and construction administration."
  }
]
